app/views/recintos/_form.html.erb

    <%= form.label :tipo_propiedad_id %>
    <%= form.select :tipo_propiedad_id, TipoPropiedad.pluck(:name, :id) %>
---
SELECT "tipo_propiedads"."name", "tipo_propiedads"."id" FROM "tipo_propiedads"