app/controllers/propiedads_controller.rb

SELECT "propiedads".* FROM "propiedads"
---
  def index
    @propiedads = Propiedad.all

INSERT INTO "propiedads" ("id_recinto", "direccion", "numero", "departamento", "rol", "mt", "coeficiente", "tipo_propiedad", "torre", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @propiedad = Propiedad.new(propiedad_params)
    @propiedad.user = current_user
    respond_to do |format|
      if @propiedad.save

UPDATE "propiedads" SET "numero" = $1, "updated_at" = $2 WHERE "propiedads"."id" = $3  [["numero", "12345"], ["updated_at", "2017-11-10 00:42:45.179048"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @propiedad.update(propiedad_params)

DELETE FROM "propiedads" WHERE "propiedads"."id" = $1  [["id", 1]]
---
  def destroy
    @propiedad.destroy

SELECT  "propiedads".* FROM "propiedads" WHERE "propiedads"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_propiedad
      @propiedad = Propiedad.find(params[:id])