app/controllers/recintos_controller.rb

SELECT "recintos".* FROM "recintos"
---
  def index
    @recintos = Recinto.all

INSERT INTO "recintos" ("direccion_recinto", "numero_recinto", "comuna_recinto", "ciudad_recinto", "region_recinto", "pais_recinto", "ubicacion_recinto", "created_at", "updated_at", "tipo_propiedad_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @recinto = Recinto.new(recinto_params)

    respond_to do |format|
      if @recinto.save

DELETE FROM "recintos" WHERE "recintos"."id" = $1  [["id", 1]]
---
  def destroy
    @recinto.destroy

SELECT  "recintos".* FROM "recintos" WHERE "recintos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_recinto
      @recinto = Recinto.find(params[:id])