app/controllers/tipo_propiedads_controller.rb

  def index
    @tipo_propiedads = TipoPropiedad.all
---
SELECT "tipo_propiedads".* FROM "tipo_propiedads"

  def create
    @tipo_propiedad = TipoPropiedad.new(tipo_propiedad_params)

    respond_to do |format|
      if @tipo_propiedad.save
---
INSERT INTO "tipo_propiedads" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Condominios"], ["created_at", "2017-11-26 00:51:35.619769"], ["updated_at", "2017-11-26 00:51:35.619769"]]

    def set_tipo_propiedad
      @tipo_propiedad = TipoPropiedad.find(params[:id])
---
SELECT  "tipo_propiedads".* FROM "tipo_propiedads" WHERE "tipo_propiedads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]